##Реализовать функцию, которая вычисляет разницу между двумя списками.
# Функция должна удалить из первого списка (a) все элементы, которые присутствуют во втором списке (b). 
# Порядок элементов в первом списке должен быть сохранен в результате.

a = [1,2,3,4,4,5]
b = [1,3]

def array_diff(a, b):
    b_set = set(b)
    array = [x for x in a if x not in b_set]
    return array

print(array_diff(a,b))



##Напишите функцию, которая вернет количество различных нечувствительных к регистру буквенных символов и цифровых разрядов,
# которые встречаются более одного раза во входной строке.
# Можно предположить, что входная строка содержит только буквы (как прописные, так и строчные) и цифры.

text = "aabBcde"
def duplicate_count(text):
    text_l = text.lower()
    duplicate = [char for char in set(text_l) if text_l.count(char) >1]
    return len(duplicate)
print(duplicate_count(text))