##Хватит это терпеть! Элис и Боб вернулись из отпуска. Они сделали множество фотографий посещенных мест и теперь хотят показать Чарли всю свою коллекцию. 
# Однако Чарли не любит такие просмотры, так как сюжеты часто повторяются: ему совсем не хочется смотреть на Эйфелеву башню 40 раз подряд. 
# Он согласен на просмотр только при условии, что каждое изображение (или «мотив», представленный числом) будет показано не более N раз. 
# К счастью, Элис и Боб могут представить каждый сюжет в виде числа. Помогите им удалить лишние числа так, чтобы каждое из них встречалось в итоговом списке не более N раз,
# сохранив при этом исходный порядок элементов. Задача: на основе заданного списка и числа N сформировать новый список, в котором каждое число из исходного списка встречается не более N раз,
# без изменения порядка следования элементов. Например, если N равно 2, а исходный список — [1, 2, 3, 1, 2, 1, 2, 3], то мы берем [1, 2, 3, 1, 2], пропускаем следующие [1, 2] 
# (так как это привело бы к тому, что числа 1 и 2 встретились бы в результате трижды), а затем берем 3; в итоге получаем [1, 2, 3, 1, 2, 3]. 
# Для списка [20, 37, 20, 21] и числа 1 результатом будет [20, 37, 21].
def delete_nth(order,max_e):
    counts = dict()
    result = []
    for num in order:
        current_count = counts.get(num, 0)
        if current_count < max_e:
            result.append(num)
            counts[num] = current_count + 1
    return result


print(delete_nth([20,37,20,21], 1))
print(delete_nth([25, 34, 44, 20, 3, 21, 25, 23, 34, 34, 25, 34, 20, 28, 44, 44, 44, 36, 44, 28, 36, 27, 27, 20, 23, 20, 27, 36, 27, 27, 44, 36, 20, 25, 23, 27, 36, 23, 36, 23, 23, 25, 28, 44, 3, 20, 25, 20, 27, 28, 36, 44, 27, 25, 27, 25, 36, 21, 20, 23, 25, 23, 36, 21, 23, 27, 34, 34], 1))
print(delete_nth([28, 28, 36, 36, 28, 36, 28, 28, 36, 28, 28, 1, 28, 28, 36, 28, 36, 36], 8))